import uuid


class UniqueIDIterator:
    """
    Ітератор для генерації унікальних ідентифікаторів на основі UUID.

    Ідентифікатори генеруються один за одним при кожній ітерації
    і є унікальними.
    """

    def __iter__(self):
        """
        Повертає ітератор для генерації унікальних ідентифікаторів.

        :return: Ітератор, який генерує унікальні ідентифікатори.
        :rtype: iterator
        """
        return self

    def __next__(self):
        """
        Генерує унікальний ідентифікатор на основі UUID.

        :return: Унікальний ідентифікатор.
        :rtype: str
        """
        return str(uuid.uuid4())


# Використання ітератора для генерації унікальних ідентифікаторів
id_iterator = UniqueIDIterator()

# Генерація кількох ідентифікаторів
for _ in range(5):
    print(next(id_iterator))
