"""
Основний скрипт для запуску програми управління базою даних фільмів.

Цей скрипт виконує наступні дії:
1. Ініціалізує об'єкт Display для взаємодії з користувачем.
2. Створює об'єкт MovieDatabase для управління базою даних.
3. Створює необхідні таблиці в базі даних.
4. Ініціалізує та запускає головне меню додатку.

Передумови:
- Наявність файлів конфігурації для налаштування логування та параметрів бази даних.
- Наявність SQL-скриптів для створення таблиць та виконання запитів.
"""

from movie_database import MovieDatabase  # Імпортуємо MovieDatabase для управління базою даних фільмів
from display import Display  # Імпортуємо Display для взаємодії з користувачем
from menu import Menu  # Імпортуємо Menu для управління головним меню додатку


def main():
    """
    Основна функція для запуску програми управління базою даних фільмів.

    :return: None
    """
    # Ініціалізуємо екземпляр Display для взаємодії з користувачем
    display_instance = Display()

    # Ініціалізуємо екземпляр MovieDatabase, передаючи об'єкт Display
    db = MovieDatabase(display=display_instance)

    # Створюємо необхідні таблиці в базі даних, якщо вони ще не існують
    db.create_tables()

    # Ініціалізуємо екземпляр Menu, передаючи об'єкти MovieDatabase та Display
    menu = Menu(db, display_instance)

    # Запускаємо головний цикл меню, що дозволяє користувачу вибирати дії
    menu.run()


if __name__ == "__main__":
    main()
