import re


def search_format(text):
    """
    Пошук унікальних кодів у заданому форматі в тексті.

    :param text: Вхідний текст, у якому здійснюється пошук кодів.
    :type text: str
    :return: Список кодів, які відповідають заданому формату.
    :rtype: list
    """
    pattern = r'([A-Z]{2}[0-9]{2}[A-Z]{2}[0-9]{2})'
    valid_format = re.findall(pattern, text)
    return valid_format


text = """
Для завершення реєстрації, будь ласка, введіть ваш унікальний код користувача: AB12CD34.

Якщо ви хочете використати наш промокод для знижки, введіть: CD34EF56 при оформленні замовлення.

Номер вашого замовлення: GH78IJ90. Збережіть його для відстеження доставки.

Працівникам компанії присвоюються такі ідентифікатори, як KL56MN78, для спрощення внутрішньої системи обліку.

Також, не забудьте, що за гарантійним талоном вам видано серійний номер пристрою QR90ST12, який знадобиться при зверненні до сервісного центру.
"""

print(search_format(text))
