import re


def search_address(text):
    """
    Пошук усіх коректних IPv4-адрес у тексті.

    :param text: Вхідний текст, у якому здійснюється пошук IPv4-адрес.
    :type text: str
    :return: Нічого не повертає, виводить список знайдених IPv4-адрес.
    :rtype: None
    """
    # Шаблон для пошуку всіх коректних IPv4-адрес
    pattern = r"\b(25[0-5]|2[0-4]\d|1\d{2}|\d{1,2})\.(25[0-5]|2[0-4]\d|1\d{2}|\d{1,2})\.(25[0-5]|2[0-4]\d|1\d{2}|\d{1,2})\.(25[0-5]|2[0-4]\d|1\d{2}|\d{1,2})\b"
    addresses = re.findall(pattern, text)

    # Відновлюємо повну адресу з кортежу груп
    valid_addresses = [".".join(address) for address in addresses]

    print(f"IPv4-адреси: {valid_addresses}")


text = """
Для доступу до локальної мережі, використовуйте IP-адресу 255.168.1.1. Якщо виникли проблеми з підключенням, спробуйте також адресу 192.168.0.254.

Сервер компанії доступний за IP-адресою 10.0.0.1, а резервний сервер - за адресою 10.0.1.1. В разі проблем із з'єднанням, можна звернутися до адміністратора за адресою 172.16.0.1 або 172.16.1.100.

Для перевірки безпеки використовуйте зовнішню адресу 8.8.8.8 або 8.8.4.4, що належать до публічних DNS-серверів Google.
"""

search_address(text)
